using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public static class Utilities
{
    public static readonly Color[][] colors = 
    {
         new Color[] // 立春
        {
            new Color (255 / 255f, 247 / 255f, 153 / 255f, 1), // 黄白游
            new Color (255 / 255f, 238 / 255f, 111 / 255f, 1), // 松花
            new Color (236 / 255f, 212 / 255f, 82 / 255f, 1), // 缃叶
            new Color (182 / 255f, 160 / 255f, 20 / 255f, 1) // 苍黄
        },
        new Color[] // 立春
        {
            new Color (213 / 255f, 235 / 255f, 225 / 255f, 1), // 天缥
            new Color (177 / 255f, 213 / 255f, 200 / 255f, 1), // 沧浪
            new Color (153 / 255f, 188 / 255f, 172 / 255f, 1), // 苍筤
            new Color (128 / 255f, 164 / 255f, 146 / 255f, 1) // 缥碧
        },
        new Color[] // 立春
        {
            new Color (139 / 255f, 112 / 255f, 66 / 255f, 1), // 流黄
            new Color (119 / 255f, 80 / 255f, 57 / 255f, 1), // 栗壳
            new Color (95 / 255f, 67 / 255f, 33 / 255f, 1), // 龙战
            new Color (66 / 255f, 37 / 255f, 23 / 255f, 1) // 青骊
        },
        new Color[] // 立春
        {
            new Color (243 / 255f, 166 / 255f, 148 / 255f, 1), // 海天霞
            new Color (238 / 255f, 121 / 255f, 89 / 255f, 1), // 缙云
            new Color (186 / 255f, 81 / 255f, 64 / 255f, 1), // 纁黄
            new Color (193 / 255f, 44 / 255f, 31 / 255f, 1) // 珊瑚赫
        },
        new Color[] // 雨水
        {
            new Color (249 / 255f, 211 / 255f, 227 / 255f, 1), // 盈盈
            new Color (236 / 255f, 176 / 255f, 193 / 255f, 1), // 水红
            new Color (221 / 255f, 118 / 255f, 148 / 255f, 1), // 苏梅
            new Color (167 / 255f, 98 / 255f, 131 / 255f, 1) // 紫茎屏风
        },
        new Color[] // 雨水
        {
            new Color (190 / 255f, 177 / 255f, 170 / 255f, 1), // 葭灰
            new Color (180 / 255f, 146 / 255f, 115 / 255f, 1), // 黄埃
            new Color (164 / 255f, 98 / 255f, 68 / 255f, 1), // 老僧衣
            new Color (107 / 255f, 84 / 255f, 88 / 255f, 1) // 玄天
        },
        new Color[] // 雨水
        {
            new Color (229 / 255f, 168 / 255f, 75 / 255f, 1), // 黄河琉璃
            new Color (225 / 255f, 138 / 255f, 59 / 255f, 1), // 库金
            new Color (152 / 255f, 79 / 255f, 49 / 255f, 1), // 缊韨
            new Color (124 / 255f, 70 / 255f, 30 / 255f, 1) // 紫瓯
        },
        new Color[] // 雨水
        {
            new Color (192 / 255f, 214 / 255f, 149 / 255f, 1), // 欧碧
            new Color (169 / 255f, 190 / 255f, 123 / 255f, 1), // 春辰
            new Color (119 / 255f, 150 / 255f, 73 / 255f, 1), // 碧山
            new Color (79 / 255f, 111 / 255f, 70 / 255f, 1) // 青青
        },
        new Color[] // 惊蛰
        {
            new Color (186 / 255f, 91 / 255f, 73 / 255f, 1), // 赤缇
            new Color (166 / 255f, 64 / 255f, 54 / 255f, 1), // 朱草
            new Color (158 / 255f, 42 / 255f, 34 / 255f, 1), // 綪茷
            new Color (124 / 255f, 25 / 255f, 30 / 255f, 1) // 顺圣
        },
        new Color[] // 惊蛰
        {
            new Color (246 / 255f, 190 / 255f, 200 / 255f, 1), // 桃夭
            new Color (240 / 255f, 145 / 255f, 160 / 255f, 1), // 杨妃
            new Color (220 / 255f, 107 / 255f, 130 / 255f, 1), // 长春
            new Color (195 / 255f, 92 / 255f, 93 / 255f, 1) // 牙绯
        },
        new Color[] // 惊蛰
        {
            new Color (254 / 255f, 220 / 255f, 94 / 255f, 1), // 黄栗留
            new Color (250 / 255f, 192 / 255f, 61 / 255f, 1), // 栀子
            new Color (219 / 255f, 155 / 255f, 52 / 255f, 1), // 黄不老
            new Color (198 / 255f, 121 / 255f, 21 / 255f, 1) // 柘黄
        },
        new Color[] // 惊蛰
        {
            new Color (154 / 255f, 167 / 255f, 177 / 255f, 1), // 青鸾
            new Color (107 / 255f, 121 / 255f, 142 / 255f, 1), // 菘蓝
            new Color (69 / 255f, 70 / 255f, 94 / 255f, 1), // 青黛
            new Color (44 / 255f, 47 / 255f, 59 / 255f, 1) // 绀蝶
        },
        new Color[] // 春分
        {
            new Color (235 / 255f, 238 / 255f, 232 / 255f, 1), // 皦玉
            new Color (235 / 255f, 237 / 255f, 223 / 255f, 1), // 吉量
            new Color (224 / 255f, 224 / 255f, 208 / 255f, 1), // 韶粉
            new Color (199 / 255f, 198 / 255f, 182 / 255f, 1) // 霜地
        },
        new Color[] // 春分
        {
            new Color (210 / 255f, 175 / 255f, 157 / 255f, 1), // 夏籥
            new Color (188 / 255f, 131 / 255f, 107 / 255f, 1), // 紫磨金
            new Color (178 / 255f, 109 / 255f, 93 / 255f, 1), // 檀色
            new Color (154 / 255f, 102 / 255f, 85 / 255f, 1) // 赭罗
        },
        new Color[] // 春分
        {
            new Color (234 / 255f, 85 / 255f, 20 / 255f, 1), // 黄丹
            new Color (210 / 255f, 57 / 255f, 24 / 255f, 1), // 洛神珠
            new Color (200 / 255f, 22 / 255f, 29 / 255f, 1), // 丹雘
            new Color (167 / 255f, 33 / 255f, 38 / 255f, 1) // 水华朱
        },
        new Color[] // 春分
        {
            new Color (50 / 255f, 113 / 255f, 174 / 255f, 1), // 青冥
            new Color (0 / 255f, 113 / 255f, 117 / 255f, 1), // 青雘
            new Color (40 / 255f, 72 / 255f, 82 / 255f, 1), // 青緺
            new Color (18 / 255f, 38 / 255f, 79 / 255f, 1) // 骐驎
        },
        new Color[] // 清明
        {
            new Color (166 / 255f, 85 / 255f, 157 / 255f, 1), // 紫蒲
            new Color (138 / 255f, 24 / 255f, 116 / 255f, 1), // 赪紫
            new Color (108 / 255f, 33 / 255f, 109 / 255f, 1), // 齐紫
            new Color (66 / 255f, 34 / 255f, 86 / 255f, 1) // 凝夜紫
        },
        new Color[] // 清明
        {
            new Color (190 / 255f, 194 / 255f, 179 / 255f, 1), // 冻缥
            new Color (157 / 255f, 157 / 255f, 130 / 255f, 1), // 春碧
            new Color (145 / 255f, 145 / 255f, 119 / 255f, 1), // 执大象
            new Color (121 / 255f, 131 / 255f, 108 / 255f, 1) // 苔古
        },
        new Color[] // 清明
        {
            new Color (211 / 255f, 204 / 255f, 214 / 255f, 1), // 香炉紫烟
            new Color (155 / 255f, 142 / 255f, 169 / 255f, 1), // 紫菂
            new Color (126 / 255f, 82 / 255f, 127 / 255f, 1), // 拂紫绵
            new Color (102 / 255f, 61 / 255f, 116 / 255f, 1) // 三公子
        },
        new Color[] // 清明
        {
            new Color (203 / 255f, 92 / 255f, 131 / 255f, 1), // 琅玕紫
            new Color (184 / 255f, 53 / 255f, 112 / 255f, 1), // 红踯躅
            new Color (167 / 255f, 55 / 255f, 102 / 255f, 1), // 魏红
            new Color (144 / 255f, 55 / 255f, 84 / 255f, 1) // 魏紫
        },
        new Color[] // 谷雨
        {
            new Color (220 / 255f, 199 / 255f, 225 / 255f, 1), // 昌荣
            new Color (187 / 255f, 161 / 255f, 203 / 255f, 1), // 紫薄汗
            new Color (166 / 255f, 126 / 255f, 183 / 255f, 1), // 茈藐
            new Color (125 / 255f, 82 / 255f, 132 / 255f, 1) // 紫紶
        },
        new Color[] // 谷雨
        {
            new Color (168 / 255f, 191 / 255f, 143 / 255f, 1), // 苍葭
            new Color (104 / 255f, 148 / 255f, 92 / 255f, 1), // 庭芜绿
            new Color (76 / 255f, 128 / 255f, 69 / 255f, 1), // 翠微
            new Color (68 / 255f, 106 / 255f, 55 / 255f, 1) // 翠虬
        },
        new Color[] // 谷雨
        {
            new Color (174 / 255f, 208 / 255f, 238 / 255f, 1), // 碧落
            new Color (110 / 255f, 155 / 255f, 197 / 255f, 1), // 挼蓝
            new Color (53 / 255f, 78 / 255f, 107 / 255f, 1), // 青雀头黛
            new Color (19 / 255f, 57 / 255f, 62 / 255f, 1) // 螺子黛
        },
        new Color[] // 谷雨
        {
            new Color (189 / 255f, 130 / 255f, 83 / 255f, 1), // 露褐
            new Color (148 / 255f, 86 / 255f, 53 / 255f, 1), // 檀褐
            new Color (128 / 255f, 76 / 255f, 46 / 255f, 1), // 緅絺
            new Color (91 / 255f, 50 / 255f, 34 / 255f, 1) // 目童子
        },
        new Color[] // 立夏
        {
            new Color (195 / 255f, 217 / 255f, 78 / 255f, 1), // 青粲
            new Color (183 / 255f, 211 / 255f, 50 / 255f, 1), // 翠缥
            new Color (158 / 255f, 188 / 255f, 25 / 255f, 1), // 人籁
            new Color (132 / 255f, 167 / 255f, 41 / 255f, 1) // 水龙吟
        },
        new Color[] // 立夏
        {
            new Color (223 / 255f, 206 / 255f, 180 / 255f, 1), // 地籁
            new Color (191 / 255f, 167 / 255f, 130 / 255f, 1), // 大块
            new Color (180 / 255f, 155 / 255f, 127 / 255f, 1), // 养生主
            new Color (148 / 255f, 120 / 255f, 79 / 255f, 1) // 大云
        },
        new Color[] // 立夏
        {
            new Color (190 / 255f, 194 / 255f, 188 / 255f, 1), // 溶溶月
            new Color (168 / 255f, 161 / 255f, 156 / 255f, 1), // 绍衣
            new Color (146 / 255f, 137 / 255f, 123 / 255f, 1), // 石莲褐
            new Color (112 / 255f, 105 / 255f, 93 / 255f, 1) // 黑朱
        },
        new Color[] // 立夏
        {
            new Color (242 / 255f, 154 / 255f, 118 / 255f, 1), // 朱颜酡
            new Color (237 / 255f, 109 / 255f, 61 / 255f, 1), // 苕荣
            new Color (233 / 255f, 72 / 255f, 41 / 255f, 1), // 檎丹
            new Color (230 / 255f, 0 / 255f, 18 / 255f, 1) // 丹罽
        },
        new Color[] // 小满
        {
            new Color (226 / 255f, 162 / 255f, 172 / 255f, 1), // 彤管
            new Color (221 / 255f, 107 / 255f, 123 / 255f, 1), // 渥赭
            new Color (194 / 255f, 81 / 255f, 96 / 255f, 1), // 唇脂
            new Color (184 / 255f, 26 / 255f, 53 / 255f, 1) // 朱孔阳
        },
        new Color[] // 小满
        {
            new Color (106 / 255f, 141 / 255f, 82 / 255f, 1), // 石发
            new Color (93 / 255f, 131 / 255f, 81 / 255f, 1), // 漆姑
            new Color (79 / 255f, 121 / 255f, 74 / 255f, 1), // 芰荷
            new Color (42 / 255f, 110 / 255f, 63 / 255f, 1) // 官绿
        },
        new Color[] // 小满
        {
            new Color (212 / 255f, 201 / 255f, 170 / 255f, 1), // 仙米
            new Color (180 / 255f, 163 / 255f, 121 / 255f, 1), // 黄螺
            new Color (158 / 255f, 131 / 255f, 88 / 255f, 1), // 降真香
            new Color (129 / 255f, 102 / 255f, 59 / 255f, 1) // 远志
        },
        new Color[] // 小满
        {
            new Color (242 / 255f, 200 / 255f, 103 / 255f, 1), // 嫩鹅黄
            new Color (211 / 255f, 162 / 255f, 55 / 255f, 1), // 鞠衣
            new Color (208 / 255f, 134 / 255f, 53 / 255f, 1), // 郁金裙
            new Color (159 / 255f, 96 / 255f, 39 / 255f, 1) // 黄流
        },
        new Color[] // 芒种
        {
            new Color (213 / 255f, 209 / 255f, 174 / 255f, 1), // 筠雾
            new Color (191 / 255f, 192 / 255f, 150 / 255f, 1), // 瓷秘
            new Color (169 / 255f, 168 / 255f, 134 / 255f, 1), // 琬琰
            new Color (146 / 255f, 144 / 255f, 93 / 255f, 1) // 青圭
        },
        new Color[] // 芒种
        {
            new Color (179 / 255f, 181 / 255f, 156 / 255f, 1), // 鸣珂
            new Color (168 / 255f, 176 / 255f, 146 / 255f, 1), // 青玉案
            new Color (169 / 255f, 167 / 255f, 115 / 255f, 1), // 出岫
            new Color (134 / 255f, 140 / 255f, 78 / 255f, 1) // 风入松
        },
        new Color[] // 芒种
        {
            new Color (221 / 255f, 187 / 255f, 153 / 255f, 1), // 如梦令
            new Color (210 / 255f, 163 / 255f, 108 / 255f, 1), // 芸黄
            new Color (190 / 255f, 148 / 255f, 87 / 255f, 1), // 金埒
            new Color (180 / 255f, 136 / 255f, 77 / 255f, 1) // 雌黄
        },
        new Color[] // 芒种
        {
            new Color (83 / 255f, 81 / 255f, 100 / 255f, 1), // 曾青
            new Color (69 / 255f, 70 / 255f, 89 / 255f, 1), // 䒌靘
            new Color (52 / 255f, 48 / 255f, 65 / 255f, 1), // 璆琳
            new Color (30 / 255f, 39 / 255f, 50 / 255f, 1) // 瑾瑜
        },
        new Color[] // 小暑
        {
            new Color (245 / 255f, 176 / 255f, 135 / 255f, 1), // 骍刚
            new Color (241 / 255f, 143 / 255f, 96 / 255f, 1), // 赪霞
            new Color (239 / 255f, 132 / 255f, 93 / 255f, 1), // 赪尾
            new Color (237 / 255f, 109 / 255f, 70 / 255f, 1) // 朱柿
        },
        new Color[] // 小暑
        {
            new Color (224 / 255f, 223 / 255f, 198 / 255f, 1), // 天球
            new Color (191 / 255f, 185 / 255f, 156 / 255f, 1), // 行香子
            new Color (169 / 255f, 159 / 255f, 112 / 255f, 1), // 王刍
            new Color (135 / 255f, 125 / 255f, 82 / 255f, 1) // 荩箧
        },
        new Color[] // 小暑
        {
            new Color (149 / 255f, 64 / 255f, 36 / 255f, 1), // 赤灵
            new Color (135 / 255f, 52 / 255f, 36 / 255f, 1), // 丹秫
            new Color (102 / 255f, 43 / 255f, 31 / 255f, 1), // 木兰
            new Color (76 / 255f, 30 / 255f, 26 / 255f, 1) // 麒麟竭
        },
        new Color[] // 小暑
        {
            new Color (16 / 255f, 104 / 255f, 152 / 255f, 1), // 柔蓝
            new Color (18 / 255f, 80 / 255f, 123 / 255f, 1), // 碧城
            new Color (6 / 255f, 67 / 255f, 111 / 255f, 1), // 蓝采和
            new Color (0 / 255f, 52 / 255f, 96 / 255f, 1) // 帝释青
        },
        new Color[] // 夏至
        {
            new Color (203 / 255f, 82 / 255f, 62 / 255f, 1), // 赩炽
            new Color (177 / 255f, 59 / 255f, 46 / 255f, 1), // 石榴裙
            new Color (149 / 255f, 48 / 255f, 46 / 255f, 1), // 朱湛
            new Color (130 / 255f, 35 / 255f, 39 / 255f, 1) // 大繎
        },
        new Color[] // 夏至
        {
            new Color (178 / 255f, 182 / 255f, 182 / 255f, 1), // 月魄
            new Color (167 / 255f, 170 / 255f, 161 / 255f, 1), // 不皂
            new Color (122 / 255f, 123 / 255f, 120 / 255f, 1), // 雷雨垂
            new Color (104 / 255f, 106 / 255f, 103 / 255f, 1) // 石涅
        },
        new Color[] // 夏至
        {
            new Color (240 / 255f, 194 / 255f, 162 / 255f, 1), // 扶光
            new Color (219 / 255f, 156 / 255f, 94 / 255f, 1), // 椒房
            new Color (217 / 255f, 136 / 255f, 61 / 255f, 1), // 红友
            new Color (204 / 255f, 93 / 255f, 32 / 255f, 1) // 光明砂
        },
        new Color[] // 夏至
        {
            new Color (245 / 255f, 243 / 255f, 242 / 255f, 1), // 山矾
            new Color (234 / 255f, 229 / 255f, 227 / 255f, 1), // 玉頩
            new Color (223 / 255f, 224 / 255f, 217 / 255f, 1), // 二目鱼
            new Color (212 / 255f, 211 / 255f, 202 / 255f, 1) // 明月珰
        },
        new Color[] // 大暑
        {
            new Color (227 / 255f, 173 / 255f, 185 / 255f, 1), // 夕岚
            new Color (207 / 255f, 146 / 255f, 158 / 255f, 1), // 雌霓
            new Color (178 / 255f, 119 / 255f, 119 / 255f, 1), // 绛纱
            new Color (163 / 255f, 95 / 255f, 101 / 255f, 1) // 茹藘
        },
        new Color[] // 大暑
        {
            new Color (237 / 255f, 241 / 255f, 187 / 255f, 1), // 葱青
            new Color (227 / 255f, 235 / 255f, 152 / 255f, 1), // 少艾
            new Color (216 / 255f, 222 / 255f, 138 / 255f, 1), // 绮钱
            new Color (205 / 255f, 209 / 255f, 113 / 255f, 1) // 翠樽
        },
        new Color[] // 大暑
        {
            new Color (212 / 255f, 191 / 255f, 137 / 255f, 1), // 石蜜
            new Color (191 / 255f, 166 / 255f, 112 / 255f, 1), // 沙饧
            new Color (170 / 255f, 142 / 255f, 89 / 255f, 1), // 巨吕
            new Color (137 / 255f, 109 / 255f, 71 / 255f, 1) // 吉金
        },
        new Color[] // 大暑
        {
            new Color (190 / 255f, 210 / 255f, 187 / 255f, 1), // 山岚
            new Color (155 / 255f, 180 / 255f, 150 / 255f, 1), // 渌波
            new Color (129 / 255f, 163 / 255f, 128 / 255f, 1), // 青楸
            new Color (105 / 255f, 142 / 255f, 106 / 255f, 1) // 菉竹
        },
        new Color[] // 立秋
        {
            new Color (136 / 255f, 171 / 255f, 218 / 255f, 1), // 窃蓝
            new Color (111 / 255f, 148 / 255f, 205 / 255f, 1), // 监德
            new Color (89 / 255f, 118 / 255f, 186 / 255f, 1), // 苍苍
            new Color (46 / 255f, 89 / 255f, 167 / 255f, 1) // 群青
        },
        new Color[] // 立秋
        {
            new Color (152 / 255f, 182 / 255f, 194 / 255f, 1), // 白青
            new Color (127 / 255f, 159 / 255f, 175 / 255f, 1), // 竹月
            new Color (102 / 255f, 136 / 255f, 158 / 255f, 1), // 空青
            new Color (84 / 255f, 118 / 255f, 137 / 255f, 1) // 太师青
        },
        new Color[] // 立秋
        {
            new Color (239 / 255f, 239 / 255f, 239 / 255f, 1), // 缟羽
            new Color (216 / 255f, 209 / 255f, 197 / 255f, 1), // 香皮
            new Color (198 / 255f, 190 / 255f, 177 / 255f, 1), // 云母
            new Color (172 / 255f, 159 / 255f, 138 / 255f, 1) // 佩玖
        },
        new Color[] // 立秋
        {
            new Color (192 / 255f, 208 / 255f, 157 / 255f, 1), // 麹尘
            new Color (147 / 255f, 143 / 255f, 76 / 255f, 1), // 绿沈
            new Color (127 / 255f, 117 / 255f, 76 / 255f, 1), // 绞衣
            new Color (89 / 255f, 83 / 255f, 51 / 255f, 1) // 素綦
        },
        new Color[] // 秋分
        {
            new Color (213 / 255f, 227 / 255f, 212 / 255f, 1), // 卵色
            new Color (202 / 255f, 215 / 255f, 197 / 255f, 1), // 葭菼
            new Color (190 / 255f, 202 / 255f, 183 / 255f, 1), // 冰台
            new Color (179 / 255f, 189 / 255f, 169 / 255f, 1) // 青古
        },
        new Color[] // 秋分
        {
            new Color (192 / 255f, 173 / 255f, 94 / 255f, 1), // 栾华
            new Color (170 / 255f, 150 / 255f, 73 / 255f, 1), // 大赤
            new Color (143 / 255f, 61 / 255f, 44 / 255f, 1), // 佛赤
            new Color (104 / 255f, 54 / 255f, 50 / 255f, 1) // 蜜褐
        },
        new Color[] // 秋分
        {
            new Color (73 / 255f, 148 / 255f, 196 / 255f, 1), // 孔雀蓝
            new Color (65 / 255f, 130 / 255f, 164 / 255f, 1), // 吐绶蓝
            new Color (50 / 255f, 120 / 255f, 138 / 255f, 1), // 鱼师青
            new Color (0 / 255f, 109 / 255f, 135 / 255f, 1) // 软翠
        },
        new Color[] // 秋分
        {
            new Color (234 / 255f, 238 / 255f, 241 / 255f, 1), // 浅云
            new Color (212 / 255f, 221 / 255f, 225 / 255f, 1), // 素采
            new Color (189 / 255f, 203 / 255f, 210 / 255f, 1), // 影青
            new Color (178 / 255f, 191 / 255f, 195 / 255f, 1) // 逍遥游
        },
        new Color[] // 处暑
        {
            new Color (240 / 255f, 207 / 255f, 227 / 255f, 1), // 退红
            new Color (228 / 255f, 184 / 255f, 213 / 255f, 1), // 樱花
            new Color (206 / 255f, 147 / 255f, 191 / 255f, 1), // 丁香
            new Color (186 / 255f, 121 / 255f, 177 / 255f, 1) // 木槿
        },
        new Color[] // 处暑
        {
            new Color (201 / 255f, 207 / 255f, 193 / 255f, 1), // 余白
            new Color (168 / 255f, 183 / 255f, 140 / 255f, 1), // 兰苕
            new Color (144 / 255f, 160 / 255f, 125 / 255f, 1), // 碧滋
            new Color (108 / 255f, 134 / 255f, 80 / 255f, 1) // 葱倩
        },
        new Color[] // 处暑
        {
            new Color (162 / 255f, 210 / 255f, 226 / 255f, 1), // 云门
            new Color (135 / 255f, 192 / 255f, 202 / 255f, 1), // 西子
            new Color (90 / 255f, 164 / 255f, 174 / 255f, 1), // 天水碧
            new Color (16 / 255f, 139 / 255f, 150 / 255f, 1) // 法翠
        },
        new Color[] // 处暑
        {
            new Color (234 / 255f, 216 / 255f, 154 / 255f, 1), // 桑蕾
            new Color (213 / 255f, 180 / 255f, 92 / 255f, 1), // 太一余粮
            new Color (191 / 255f, 156 / 255f, 70 / 255f, 1), // 秋香
            new Color (170 / 255f, 133 / 255f, 52 / 255f, 1) // 老茯神
        },
        new Color[] // 小雪
        {
            new Color (222 / 255f, 130 / 255f, 167 / 255f, 1), // 龙膏烛
            new Color (204 / 255f, 115 / 255f, 160 / 255f, 1), // 黪紫
            new Color (185 / 255f, 90 / 255f, 137 / 255f, 1), // 胭脂水
            new Color (176 / 255f, 67 / 255f, 111 / 255f, 1) // 胭脂紫
        },
        new Color[] // 小雪
        {
            new Color (230 / 255f, 119 / 255f, 98 / 255f, 1), // 小红
            new Color (221 / 255f, 107 / 255f, 79 / 255f, 1), // 岱赭
            new Color (210 / 255f, 71 / 255f, 53 / 255f, 1), // 鹤顶红
            new Color (185 / 255f, 58 / 255f, 38 / 255f, 1) // 朱殷
        },
        new Color[] // 小雪
        {
            new Color (212 / 255f, 229 / 255f, 239 / 255f, 1), // 月白
            new Color (188 / 255f, 212 / 255f, 231 / 255f, 1), // 星郎
            new Color (163 / 255f, 187 / 255f, 219 / 255f, 1), // 晴山
            new Color (138 / 255f, 171 / 255f, 204 / 255f, 1) // 品月
        },
        new Color[] // 小雪
        {
            new Color (158 / 255f, 131 / 255f, 104 / 255f, 1), // 明茶褐
            new Color (144 / 255f, 108 / 255f, 74 / 255f, 1), // 荆褐
            new Color (124 / 255f, 91 / 255f, 62 / 255f, 1), // 驼褐
            new Color (114 / 255f, 69 / 255f, 58 / 255f, 1) // 椒褐
        },
        new Color[] // 白露
        {
            new Color (245 / 255f, 242 / 255f, 233 / 255f, 1), // 凝脂
            new Color (234 / 255f, 228 / 255f, 209 / 255f, 1), // 玉色
            new Color (223 / 255f, 214 / 255f, 184 / 255f, 1), // 黄润
            new Color (213 / 255f, 200 / 255f, 160 / 255f, 1) // 缣缃
        },
        new Color[] // 白露
        {
            new Color (134 / 255f, 144 / 255f, 138 / 255f, 1), // 蕉月
            new Color (107 / 255f, 125 / 255f, 115 / 255f, 1), // 千山翠
            new Color (85 / 255f, 95 / 255f, 77 / 255f, 1), // 结绿
            new Color (69 / 255f, 73 / 255f, 61 / 255f, 1) // 绿云
        },
        new Color[] // 白露
        {
            new Color (211 / 255f, 203 / 255f, 197 / 255f, 1), // 藕丝秋半
            new Color (200 / 255f, 181 / 255f, 179 / 255f, 1), // 苍烟落照
            new Color (146 / 255f, 129 / 255f, 135 / 255f, 1), // 红藤杖
            new Color (89 / 255f, 76 / 255f, 87 / 255f, 1) // 紫鼠
        },
        new Color[] // 白露
        {
            new Color (196 / 255f, 183 / 255f, 152 / 255f, 1), // 黄粱
            new Color (165 / 255f, 138 / 255f, 95 / 255f, 1), // 蒸栗
            new Color (124 / 255f, 98 / 255f, 63 / 255f, 1), // 射干
            new Color (100 / 255f, 77 / 255f, 49 / 255f, 1) // 油葫芦
        },
        new Color[] // 大雪
        {
            new Color (239 / 255f, 196 / 255f, 206 / 255f, 1), // 粉米
            new Color (206 / 255f, 136 / 255f, 146 / 255f, 1), // 縓缘
            new Color (195 / 255f, 92 / 255f, 106 / 255f, 1), // 美人祭
            new Color (176 / 255f, 69 / 255f, 82 / 255f, 1) // 鞓红
        },
        new Color[] // 大雪
        {
            new Color (238 / 255f, 234 / 255f, 217 / 255f, 1), // 米汤娇
            new Color (191 / 255f, 193 / 255f, 169 / 255f, 1), // 草白
            new Color (169 / 255f, 160 / 255f, 130 / 255f, 1), // 玄校
            new Color (117 / 255f, 108 / 255f, 75 / 255f, 1) // 綟绶
        },
        new Color[] // 大雪
        {
            new Color (120 / 255f, 138 / 255f, 111 / 255f, 1), // 雀梅
            new Color (93 / 255f, 114 / 255f, 89 / 255f, 1), // 油绿
            new Color (78 / 255f, 101 / 255f, 72 / 255f, 1), // 莓莓
            new Color (63 / 255f, 80 / 255f, 59 / 255f, 1) // 螺青
        },
        new Color[] // 大雪
        {
            new Color (164 / 255f, 171 / 255f, 214 / 255f, 1), // 暮山紫
            new Color (117 / 255f, 124 / 255f, 187 / 255f, 1), // 紫苑
            new Color (97 / 255f, 94 / 255f, 168 / 255f, 1), // 优昙瑞
            new Color (74 / 255f, 75 / 255f, 157 / 255f, 1) // 延维
        },
        new Color[] // 寒露
        {
            new Color (166 / 255f, 186 / 255f, 177 / 255f, 1), // 醽醁
            new Color (129 / 255f, 157 / 255f, 142 / 255f, 1), // 翠涛
            new Color (119 / 255f, 138 / 255f, 119 / 255f, 1), // 青梅
            new Color (95 / 255f, 118 / 255f, 106 / 255f, 1) // 翕赩
        },
        new Color[] // 寒露
        {
            new Color (221 / 255f, 176 / 255f, 120 / 255f, 1), // 九斤黄
            new Color (218 / 255f, 146 / 255f, 51 / 255f, 1), // 杏子
            new Color (188 / 255f, 110 / 255f, 55 / 255f, 1), // 媚蝶
            new Color (159 / 255f, 82 / 255f, 33 / 255f, 1) // 韎韐
        },
        new Color[] // 寒露
        {
            new Color (139 / 255f, 163 / 255f, 199 / 255f, 1), // 东方既白
            new Color (0 / 255f, 61 / 255f, 116 / 255f, 1), // 绀宇
            new Color (25 / 255f, 50 / 255f, 95 / 255f, 1), // 佛头青
            new Color (26 / 255f, 40 / 255f, 71 / 255f, 1) // 花青
        },
        new Color[] // 寒露
        {
            new Color (236 / 255f, 217 / 255f, 199 / 255f, 1), // 弗肯红
            new Color (225 / 255f, 193 / 255f, 153 / 255f, 1), // 赤璋
            new Color (198 / 255f, 162 / 255f, 104 / 255f, 1), // 茧色
            new Color (179 / 255f, 147 / 255f, 75 / 255f, 1) // 密陀僧
        },
        new Color[] // 小寒
        {
            new Color (246 / 255f, 249 / 255f, 228 / 255f, 1), // 酂白
            new Color (236 / 255f, 235 / 255f, 194 / 255f, 1), // 断肠
            new Color (225 / 255f, 211 / 255f, 132 / 255f, 1), // 田赤
            new Color (202 / 255f, 178 / 255f, 114 / 255f, 1) // 黄封
        },
        new Color[] // 小寒
        {
            new Color (189 / 255f, 150 / 255f, 131 / 255f, 1), // 丁香褐
            new Color (149 / 255f, 90 / 255f, 66 / 255f, 1), // 棠梨褐
            new Color (129 / 255f, 73 / 255f, 44 / 255f, 1), // 朱石栗
            new Color (104 / 255f, 54 / 255f, 26 / 255f, 1) // 枣褐
        },
        new Color[] // 小寒
        {
            new Color (125 / 255f, 146 / 255f, 159 / 255f, 1), // 秋蓝
            new Color (87 / 255f, 100 / 255f, 112 / 255f, 1), // 育阳染
            new Color (60 / 255f, 70 / 255f, 84 / 255f, 1), // 霁蓝
            new Color (21 / 255f, 29 / 255f, 41 / 255f, 1) // 獭见
        },
        new Color[] // 小寒
        {
            new Color (164 / 255f, 201 / 255f, 204 / 255f, 1), // 井天
            new Color (108 / 255f, 168 / 255f, 175 / 255f, 1), // 正青
            new Color (80 / 255f, 146 / 255f, 150 / 255f, 1), // 扁青
            new Color (34 / 255f, 107 / 255f, 104 / 255f, 1) // 䌦色
        },
        new Color[] // 立冬
        {
            new Color (255 / 255f, 251 / 255f, 199 / 255f, 1), // 半见
            new Color (247 / 255f, 238 / 255f, 173 / 255f, 1), // 女贞黄
            new Color (236 / 255f, 224 / 255f, 147 / 255f, 1), // 绢纨
            new Color (214 / 255f, 197 / 255f, 96 / 255f, 1) // 姜黄
        },
        new Color[] // 立冬
        {
            new Color (136 / 255f, 191 / 255f, 184 / 255f, 1), // 繱犗
            new Color (93 / 255f, 163 / 255f, 157 / 255f, 1), // 二绿
            new Color (61 / 255f, 142 / 255f, 134 / 255f, 1), // 铜青
            new Color (32 / 255f, 104 / 255f, 100 / 255f, 1) // 石绿
        },
        new Color[] // 立冬
        {
            new Color (158 / 255f, 140 / 255f, 107 / 255f, 1), // 黄琮
            new Color (136 / 255f, 118 / 255f, 87 / 255f, 1), // 茶色
            new Color (109 / 255f, 92 / 255f, 61 / 255f, 1), // 伽罗
            new Color (90 / 255f, 75 / 255f, 59 / 255f, 1) // 苍艾
        },
        new Color[] // 立冬
        {
            new Color (168 / 255f, 135 / 255f, 135 / 255f, 1), // 藕丝褐
            new Color (158 / 255f, 105 / 255f, 109 / 255f, 1), // 葡萄褐
            new Color (129 / 255f, 71 / 255f, 76 / 255f, 1), // 苏方
            new Color (102 / 255f, 43 / 255f, 47 / 255f, 1) // 福色
        },
        new Color[] // 冬至
        {
            new Color (231 / 255f, 202 / 255f, 211 / 255f, 1), // 银红
            new Color (217 / 255f, 160 / 255f, 179 / 255f, 1), // 莲红
            new Color (187 / 255f, 122 / 255f, 140 / 255f, 1), // 紫梅
            new Color (158 / 255f, 78 / 255f, 86 / 255f, 1) // 紫矿
        },
        new Color[] // 冬至
        {
            new Color (218 / 255f, 169 / 255f, 169 / 255f, 1), // 咸池
            new Color (205 / 255f, 115 / 255f, 114 / 255f, 1), // 红䵂
            new Color (168 / 255f, 88 / 255f, 88 / 255f, 1), // 蚩尤旗
            new Color (124 / 255f, 68 / 255f, 73 / 255f, 1) // 霁红
        },
        new Color[] // 冬至
        {
            new Color (235 / 255f, 225 / 255f, 169 / 255f, 1), // 莺儿
            new Color (225 / 255f, 210 / 255f, 121 / 255f, 1), // 禹余粮
            new Color (214 / 255f, 188 / 255f, 70 / 255f, 1), // 姚黄
            new Color (190 / 255f, 138 / 255f, 47 / 255f, 1) // 蛾黄
        },
        new Color[] // 冬至
        {
            new Color (121 / 255f, 104 / 255f, 96 / 255f, 1), // 濯绛
            new Color (88 / 255f, 82 / 255f, 72 / 255f, 1), // 墨黪
            new Color (70 / 255f, 67 / 255f, 59 / 255f, 1), // 驖骊
            new Color (49 / 255f, 50 / 255f, 44 / 255f, 1) // 京元
        },
        new Color[] // 霜降
        {
            new Color (209 / 255f, 41 / 255f, 32 / 255f, 1), // 银朱
            new Color (171 / 255f, 29 / 255f, 34 / 255f, 1), // 胭脂虫
            new Color (143 / 255f, 29 / 255f, 34 / 255f, 1), // 朱樱
            new Color (99 / 255f, 18 / 255f, 22 / 255f, 1) // 爵头
        },
        new Color[] // 霜降
        {
            new Color (189 / 255f, 178 / 255f, 178 / 255f, 1), // 甘石
            new Color (145 / 255f, 130 / 255f, 143 / 255f, 1), // 迷楼灰
            new Color (106 / 255f, 91 / 255f, 109 / 255f, 1), // 鸦雏
            new Color (92 / 255f, 79 / 255f, 85 / 255f, 1) // 烟墨
        },
        new Color[] // 霜降
        {
            new Color (248 / 255f, 198 / 255f, 181 / 255f, 1), // 十样锦
            new Color (218 / 255f, 158 / 255f, 140 / 255f, 1), // 檀唇
            new Color (215 / 255f, 127 / 255f, 102 / 255f, 1), // 琼琚
            new Color (177 / 255f, 90 / 255f, 67 / 255f, 1) // 棠梨
        },
        new Color[] // 霜降
        {
            new Color (223 / 255f, 215 / 255f, 194 / 255f, 1), // 蜜合
            new Color (212 / 255f, 193 / 255f, 166 / 255f, 1), // 假山南
            new Color (190 / 255f, 167 / 255f, 139 / 255f, 1), // 紫花布
            new Color (153 / 255f, 128 / 255f, 108 / 255f, 1) // 沉香
        },
        new Color[] // 大寒
        {
            new Color (153 / 255f, 93 / 255f, 127 / 255f, 1), // 紫府
            new Color (129 / 255f, 70 / 255f, 98 / 255f, 1), // 地血
            new Color (96 / 255f, 38 / 255f, 65 / 255f, 1), // 芥拾紫
            new Color (66 / 255f, 11 / 255f, 47 / 255f, 1) // 油紫
        },
        new Color[] // 大寒
        {
            new Color (235 / 255f, 227 / 255f, 199 / 255f, 1), // 骨缥
            new Color (202 / 255f, 197 / 255f, 160 / 255f, 1), // 青白玉
            new Color (146 / 255f, 137 / 255f, 107 / 255f, 1), // 绿豆褐
            new Color (102 / 255f, 95 / 255f, 77 / 255f, 1) // 冥色
        },
        new Color[] // 大寒
        {
            new Color (221 / 255f, 197 / 255f, 184 / 255f, 1), // 肉红
            new Color (190 / 255f, 168 / 255f, 157 / 255f, 1), // 珠子褐
            new Color (143 / 255f, 109 / 255f, 95 / 255f, 1), // 鹰背褐
            new Color (105 / 255f, 75 / 255f, 60 / 255f, 1) // 麝香褐
        },
        new Color[] // 大寒
        {
            new Color (200 / 255f, 182 / 255f, 187 / 255f, 1), // 石英
            new Color (156 / 255f, 141 / 255f, 155 / 255f, 1), // 银褐
            new Color (157 / 255f, 133 / 255f, 143 / 255f, 1), // 烟红
            new Color (118 / 255f, 85 / 255f, 93 / 255f, 1) // 紫诰
        }
    };


}
